Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.OperationEnum
The operation types.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.OperationEnum.AllTimes
GetTimes operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.OperationEnum.ObjectTimes
GetObjectTimes operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.OperationEnum.PartsOnlyInPhysical
GetPartsOnlyInPhysical operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.OperationEnum.PartsOnlyInAnalysis
GetPartsOnlyInAnalysis operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes.OperationEnum.PartsDiffering
GetPartsDiffering operation.